controllers/Mahasiswa010Controller.php

INSERT INTO `mahasiswa010` (`no_induk_mahasiswa`, `nama_mahasiswa`, `kelas`, `status`) VALUES ('60200121010-41', 'Andi Khalil Gibran', 'D', 'Baru')
---
    public function actionCreate()
    {
        $mahasiswa010 = new Mahasiswa010;
        $mahasiswa010->no_induk_mahasiswa = '60200121010-'. rand(10,99);
        $mahasiswa010->nama_mahasiswa = 'Andi Khalil Gibran';
        $mahasiswa010->kelas = 'D';
        $mahasiswa010->status = 'Baru';
        if ($mahasiswa010->save()) {

UPDATE `mahasiswa010` SET `kelas`='A', `status`='Update' WHERE `id`=23
---
    public function actionUpdate($id)
    {
        $mahasiswa010 = mahasiswa010::findOne(['id' => $id]);
        if($mahasiswa010 !== null){
            $mahasiswa010->kelas = 'A';
            $mahasiswa010->status = 'Update';
            $mahasiswa010->save();

SELECT * FROM `mahasiswa010` WHERE `id`='23'
---
    public function actionDelete($id)
    {
        $mahasiswa010= Mahasiswa010::findOne($id);